package mrutcka.rpg.hero;

public class Story {
    String[] stories = new String[999];

    public String getStories(int i) {
        return stories[i];
    }

    public void setStories() {
        stories[0] = "Самый юный герой России. Настоящий Мужчина, которому было всего 7 лет. Единственный семилетний обладатель Ордена Мужества. К сожалению, посмертно. Трагедия разыгралась вечером 28 ноября 2008г. Женя и его двенадцатилетняя старшая сестра Яна были дома одни. В дверь позвонил неизвестный мужчина, который представился почтальоном, принёсшим якобы заказное письмо.\n";
        stories[1] = "12-тилетний подросток, житель города Набережные Челны, погиб, спасая 9-тилетнего школьника. Трагедия произошла 5 мая 2012 года на бульваре Энтузиастов. Примерно в два часа дня 9-тилетний Андрей Чурбанов решил достать пластиковую бутылку, упавшую в фонтан. Неожиданно его ударило током, мальчик потерял сознание и упал в воду.\n";
        stories[2] = "Пожар в частном жилом доме в поселке Зельвено Амурской области вспыхнул поздним вечером. Обнаружили пожар соседи с большим опозданием, когда из окон горящего дома повалил густой дым. Сообщив о пожаре, жители принялись тушить пламя, заливая его водой. К тому моменту в комнатах горели вещи и стены строения. Среди тех, кто прибежал на помощь, был 14-летний Максим Кобычев. Узнав, что в доме есть люди, он, не растерявшись в сложной ситуации, проник в дом и вытащил на свежий воздух женщину-инвалида 1929 года рождения.\n";
    }
}
